source/app/controllers/blocks_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 2053932800)
---
  def find_project
    @project = Project.find(params[:project_id])

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 2 AND (`blocks`.project_id = 3))
SELECT * FROM `block_types` WHERE (`block_types`.`id` = 5)
---
  def find_block_type
    @block = Block.find(params[:id])
    @block_type = BlockType.find(@block.block_type_id)